import { EventMetaDescriptor } from "../../eventMeta";

export const meta: EventMetaDescriptor = {
  summary: "フジテレビ「千鳥の鬼レンチャン」",
  category: "TV",
  date: "2026-06-28",
  start: "19:00",
  end: "21:00",
  region: "テレビ",
  present: ["籾山ひめり"],
  images: [],
  link: {
    text: "番組サイト",
    url: "https://www.fujitv.co.jp/oniren/",
  },
  updatedAt: "2026-06-28",
};

export const content = /* md */ `
  ## 放送内容

  ### 千鳥の鬼レンチャン◆エンクミ初登場…全曲平成ソング鬼レンチャンに挑戦！

  平成バラエティ女王…遠藤久美子が初登場▽初代鬼ハード女王最有力…荒牧陽子▽BENI…鬼レン達成で鬼ハード復帰なるか▽たかねこ籾山ひめり…可愛くてごめん

  #### 放送内容詳細

  名曲のサビだけを一音も音程を外すことなく10曲連続歌唱に挑戦する大人気企画「サビだけカラオケ」に、各界の歌の実力者たちが参戦！

  底抜けの明るさで平成のバラエティを席巻した、“エンクミ”こと遠藤久美子が初参戦！全曲平成ソングでの鬼レンチャンに挑むが、号泣歌唱の理由とは――？

  さらに、以前『鬼レンチャン歌謡祭』でほいけんたと共に「可愛くてごめん」を披露し、大きな話題となった高嶺のなでしこのキャプテン・籾山ひめりが初参戦！

  そして、鬼ハードモード初代女王の大本命、荒牧陽子が再び登場。しかし、そんな荒牧には今回ある不安なことが……。また、同じく初代女王と目されながらも、前回まさかの2レンチャンに終わりノーマルモードへ降格したBENIが、並々ならぬ想いでリベンジに燃える！スタジオでは、千鳥とかまいたちが挑戦者たちの様子をモニターで見ながら「彼らが何レンチャン（＝連続成功）できるか？」を予想。選んだメンバーで千鳥軍、かまいたち軍を構成し、チームの合計レンチャン数で勝敗を競う。

  #### 出演者

  - **【MC】**
    - 千鳥（大悟、ノブ）
  - **【対決パネラー】**
    - かまいたち（山内健司、濱家隆一）
  - **【サビだけカラオケ挑戦者】**
    - 荒牧陽子
    - 遠藤久美子
    - BENI
    - 籾山ひめり（高嶺のなでしこ）
    - ※五十音順
  - **【影ナレーション】**
    - ユースケ（ダイアン）
    - ほか

  #### スタッフ

  - **【企画】**
    - 武田誠司
  - **【チーフプロデューサー】**
    - 竹岡直弘
  - **【プロデューサー】**
    - 西谷拓、島田源太郎、小網啓之、川島典子
  - **【演出】**
    - 千葉悠矢
  - **【制作協力】**
    - 吉本興業
    - UNITED PRODUCTIONS
  - **【制作著作】**
    - フジテレビ

  ## リンク

  - [出演報告 - 公式 X](https://x.com/takanenofficial/status/2071201952520708394)
  - [本日オンエア - 公式 X](https://x.com/takanenofficial/status/2071081157027049842)
  - [告知 - 公式 X](https://x.com/takanenofficial/status/2068689335055257824)
  - [告知 - 千鳥の鬼レンチャン X](https://x.com/oni_renchans/status/2068684340368994555)
  - [番組サイト](https://www.fujitv.co.jp/oniren/)
`;
