import { EventMetaDescriptor } from "../../eventMeta";

export const meta: EventMetaDescriptor = {
  summary: "テレビ朝日「かまいガチ 1時間SP放送記念!! 名作をもう一度「あの頃のラブレター歌謡祭」」",
  category: "TV",
  date: "2026-06-27",
  start: "23:30",
  end: "24:00",
  region: "テレビ",
  present: ["涼海すう", "葉月紗蘭", "東山恵里沙", "日向端ひな"],
  images: [
    {
      path: "/events/2026/2026-06-27_テレビ朝日「かまいガチ」.webp",
      ref: "https://www.tv-asahi.co.jp/kamaigachi/",
    },
  ],
  link: {
    text: "番組サイト",
    url: "https://www.tv-asahi.co.jp/kamaigachi/",
  },
  updatedAt: "2026-06-28",
};

export const content = /* md */ `
  ## 番組概要

  7月1日(水)話題の剣道企画がまさかの1時間SPに!!▼かまいたちの2人が“ガチでそのとき面白いと思うこと"に挑戦する関東初の冠レギュラー番組

  ## 番組内容

  ### ◇番組内容

  7月1日にかまいガチ1時間スペシャルの放送が決定!!<br/>
  その内容は「剣道でガチで勝ちたいねん!」<br/>
  過去に放送し話題となったこの企画!前回のメンバーに加え、今回はコロチキのナダルやモグライダーともしげなど、芸能界を代表する総勢10人の剣士が登場!!<br/>
  笑い抜きの真剣勝負!白熱の展開にゲストの森川葵も熱中!!<br/>
  前回優勝の最強剣士 高野正成を倒す者は現れるのか!!

  ### ◇番組内容2

  今回は、スペシャルの放送を記念して話題作「あの頃のラブレター歌謡祭」を放送!<br/>
  過去に書いたラブレターを勝手に歌にし、本人の前で披露するという超赤面企画!<br/>
  ゲストに畑芽育が登場!さや香新山、エルフ荒川、そして山内が書いたラブレターが披露され、その“やばすぎる"内容に一同絶句&爆笑!!<br/>
  そして、歌を歌うのは高嶺のなでしこやMr.シャチホコなど一流の歌手たち!!<br/>
  最も、赤面必至のラブレターを書いたのは誰だ!?

  ### ◇出演者

  - 濱家隆一
  - 山内健司 (かまいたち)
  - 畑芽育
  - 新山 (さや香)
  - 荒川(エルフ)
  - Mr.シャチホコ
  - ダブルネーム
  - 高嶺のなでしこ

  ### ◇おしらせ

  - 公式X(旧Twitter)<br/>
    https://x.com/kamaigachi

  - 番組ホームページ<br/>
    https://www.tv-asahi.co.jp/kamaigachi/

  ## リンク

  - [告知 - 公式 X](https://x.com/takanenofficial/status/2070791860508123471)
  - [番組サイト](https://www.tv-asahi.co.jp/kamaigachi/)
`;
