import { 涼海すう誕生日記念_2024年8月22日 } from "./birthday/2024-08-22_涼海すう誕生日記念";
import { 松本ももな誕生日記念_2024年10月12日 } from "./birthday/2024-10-12_松本ももな誕生日記念";
import { 日向端ひな誕生日記念_2024年10月30日 } from "./birthday/2024-10-30_日向端ひな誕生日記念";
import { 星谷美来誕生日記念_2024年11月6日 } from "./birthday/2024-11-06_星谷美来誕生日記念";
import { 城月菜央誕生日記念_2024年12月25日 } from "./birthday/2024-12-25_城月菜央誕生日記念";
import { 春野莉々誕生日記念_2025年01月16日 } from "./birthday/2025-01-16_春野莉々誕生日記念";
import { 葉月紗蘭誕生日記念_2025年03月03日 } from "./birthday/2025-03-03_葉月紗蘭誕生日記念";
import { 籾山ひめり誕生日記念_2025年03月22日 } from "./birthday/2025-03-22_籾山ひめり誕生日記念";
import { 東山恵里沙誕生日記念_2025年05月28日 } from "./birthday/2025-05-28_東山恵里沙誕生日記念";
import { 橋本桃呼誕生日記念_2025年05月28日 } from "./birthday/2025-06-28_橋本桃呼誕生日記念";
import { 涼海すう誕生日記念_2025年8月22日 } from "./birthday/2025-08-22_涼海すう誕生日記念";
import { 松本ももな誕生日記念_2025年10月12日 } from "./birthday/2025-10-12_松本ももな誕生日記念";
import { 日向端ひな誕生日記念_2025年10月30日 } from "./birthday/2025-10-30_日向端ひな誕生日記念";
import { BirthdayGoodsCollection } from "./product";

export const BirthdayGoods: BirthdayGoodsCollection[] = [
  日向端ひな誕生日記念_2025年10月30日,
  松本ももな誕生日記念_2025年10月12日,
  涼海すう誕生日記念_2025年8月22日,
  橋本桃呼誕生日記念_2025年05月28日,
  東山恵里沙誕生日記念_2025年05月28日,
  籾山ひめり誕生日記念_2025年03月22日,
  葉月紗蘭誕生日記念_2025年03月03日,
  春野莉々誕生日記念_2025年01月16日,
  城月菜央誕生日記念_2024年12月25日,
  星谷美来誕生日記念_2024年11月6日,
  日向端ひな誕生日記念_2024年10月30日,
  松本ももな誕生日記念_2024年10月12日,
  涼海すう誕生日記念_2024年8月22日,
];
