import { アンチファン衣装_生写真 } from "./2022/2022-08-08_生写真「アンチファン衣装」";
import { うぶごえ_生写真 } from "./2022/2022-08-29_生写真「うぶごえ限定」";
import { _2022秋服_生写真 } from "./2022/2022-10-01_生写真「2022秋服」";
import { ハロウィン_生写真 } from "./2022/2022-10-31_生写真「ハロウィン」";
import { 昭和レトロ_生写真 } from "./2022/2022-11-22_生写真「昭和レトロ」";
import { _2022サンタ_生写真 } from "./2022/2022-12-25_生写真「2022サンタ」";
import { _2023年振袖_生写真 } from "./2023/2023-01-01_生写真「2023年振袖」";
import { バレンタイン_生写真 } from "./2023/2023-02-14_生写真「バレンタイン」";
import { _2023年制服卒業シーズン_生写真 } from "./2023/2023-03-23_生写真「2023年制服卒業シーズン」";
import { たかねこ全国お招きツアー2023衣装_生写真 } from "./2023/2023-04-23_生写真「たかねこ全国お招きツアー 2023」";
import { たかねこ全国お招きツアー2023衣装_ミニフォト } from "./2023/2023-04_たかねこ全国お招きツアー2023衣装_ミニフォト";
import { イースター_生写真 } from "./2023/2023-05-01_生写真「イースター」";
import { スーツ_生写真 } from "./2023/2023-06-11_生写真「スーツ」";
import { スーツメガネ_生写真 } from "./2023/2023-06-11_生写真「スーツメガネ」";
import { 梅雨_生写真 } from "./2023/2023-06-29_生写真「梅雨」";
import { マリン_生写真 } from "./2023/2023-07-11_生写真「マリン」";
import { 浴衣_生写真 } from "./2023/2023-08-09_生写真「浴衣」";
import { 浴衣_ミニフォト } from "./2023/2023-08_浴衣_ミニフォト";
import { 僕は君になれない衣装_生写真 } from "./2023/2023-09-03_生写真「僕は君になれない衣装」";
import { 初恋のひと_生写真 } from "./2023/2023-09-12_生写真「初恋のひと。」";
import { 僕は君になれない衣装_ミニフォト } from "./2023/2023-09_僕は君になれない衣装_ミニフォト";
import { povo20_生写真 } from "./2023/2023-10-02_生写真「povo」";
import { _2023ハロウィン_生写真 } from "./2023/2023-10-25_生写真「2023ハロウィン」";
import { _2023ハロウィン_ミニフォト } from "./2023/2023-10_2023ハロウィン_ミニフォト";
import { 海の妖精_生写真 } from "./2023/2023-11-29_生写真「海の妖精」";
import { 海の妖精_ミニフォト } from "./2023/2023-11_海の妖精_ミニフォト";
import { ウインター_生写真 } from "./2023/2023-12-08_生写真「ウインター」";
import { ホワイトサンタ2023_生写真 } from "./2023/2023-12-24_生写真「ホワイトサンタ2023」";
import { ホワイトサンタ2023_ミニフォト } from "./2023/2023-12_ホワイトサンタ2023_ミニフォト";
import { _2024年振袖_生写真 } from "./2024/2024-01-03_生写真「2024年振袖」";
import { _2024年振袖_ミニフォト } from "./2024/2024-01_2024年振袖_ミニフォト";
import { _2024年バレンタイン_生写真 } from "./2024/2024-02-14_生写真「2024年バレンタイン」";
import { _2024年バレンタイン_ミニフォト } from "./2024/2024-02_2024年バレンタイン_ミニフォト";
import { 恋を知った世界_生写真 } from "./2024/2024-03-27_生写真「恋を知った世界」";
import { 恋を知った世界_ミニフォト } from "./2024/2024-03_恋を知った世界_ミニフォト";
import { Beginning_生写真 } from "./2024/2024-04-08_生写真「Beginning」";
import { ハニフェス_生写真 } from "./2024/2024-04-29_生写真「ハニフェス」";
import { Beginning_ミニフォト } from "./2024/2024-04_Beginning_ミニフォト";
import { わたし色に染まれ_生写真 } from "./2024/2024-05-12_生写真「わたし色に染まれ」";
import { ワンピース_生写真 } from "./2024/2024-05-27_生写真「ワンピース」";
import { わたし色に染まれ_ミニフォト } from "./2024/2024-05_わたし色に染まれ_ミニフォト";
import { ワンピース_ミニフォト } from "./2024/2024-05_ワンピース_ミニフォト";
import { メイド至上主義_生写真 } from "./2024/2024-06-21_生写真「メイド☆至上主義」";
import { メイド至上主義_ミニフォト } from "./2024/2024-06_メイド☆至上主義_ミニフォト";
import { 浴衣2024_生写真 } from "./2024/2024-07-12_生写真「浴衣2024」";
import { 浴衣2024_ミニフォト } from "./2024/2024-07_浴衣2024_ミニフォト";
import { 白ワンピース_生写真 } from "./2024/2024-08-07_生写真「白ワンピース」";
import { 白ワンピース_ミニフォト } from "./2024/2024-08_白ワンピース_ミニフォト";
import { 瞬きさえ忘れる_生写真 } from "./2024/2024-09-15_生写真「瞬きさえ忘れる。」";
import { 瞬きさえ忘れる_ミニフォト } from "./2024/2024-09-15_瞬きさえ忘れる_ミニフォト";
import { ライブ女子_ミニフォト } from "./2024/2024-10-25_ライブ女子_ミニフォト";
import { ライブ女子_生写真 } from "./2024/2024-10-30_生写真「ライブ女子」";
import { ハロウィン2024_ミニフォト } from "./2024/2024-10-31_ハロウィン2024_ミニフォト";
import { ハロウィン2024_生写真 } from "./2024/2024-10-31_生写真「ハロウィン2024」";
import { 高嶺のなでしこ2024衣装_生写真 } from "./2024/2024-11-08_生写真「高嶺のなでしこ2024衣装」";
import { 高嶺のなでしこ2024衣装_ミニフォト } from "./2024/2024-11-08_高嶺のなでしこ2024衣装_ミニフォト";
import { RandomGoods } from "./product";

export const PHOTOS: RandomGoods[] = [
  アンチファン衣装_生写真,
  うぶごえ_生写真,
  _2022秋服_生写真,
  ハロウィン_生写真,
  昭和レトロ_生写真,
  _2022サンタ_生写真,
  _2023年振袖_生写真,
  バレンタイン_生写真,
  _2023年制服卒業シーズン_生写真,
  たかねこ全国お招きツアー2023衣装_生写真,
  イースター_生写真,
  スーツメガネ_生写真,
  スーツ_生写真,
  梅雨_生写真,
  マリン_生写真,
  浴衣_生写真,
  初恋のひと_生写真,
  僕は君になれない衣装_生写真,
  povo20_生写真,
  _2023ハロウィン_生写真,
  海の妖精_生写真,
  ウインター_生写真,
  ホワイトサンタ2023_生写真,
  _2024年振袖_生写真,
  _2024年バレンタイン_生写真,
  恋を知った世界_生写真,
  Beginning_生写真,
  わたし色に染まれ_生写真,
  ワンピース_生写真,
  メイド至上主義_生写真,
  浴衣2024_生写真,
  白ワンピース_生写真,
  瞬きさえ忘れる_生写真,
  ライブ女子_生写真,
  ハロウィン2024_生写真,
  高嶺のなでしこ2024衣装_生写真,
];

export const MINI_PHOTO_CARDS: RandomGoods[] = [
  たかねこ全国お招きツアー2023衣装_ミニフォト,
  浴衣_ミニフォト,
  僕は君になれない衣装_ミニフォト,
  _2023ハロウィン_ミニフォト,
  海の妖精_ミニフォト,
  ホワイトサンタ2023_ミニフォト,
  _2024年振袖_ミニフォト,
  _2024年バレンタイン_ミニフォト,
  恋を知った世界_ミニフォト,
  Beginning_ミニフォト,
  わたし色に染まれ_ミニフォト,
  ワンピース_ミニフォト,
  メイド至上主義_ミニフォト,
  浴衣2024_ミニフォト,
  白ワンピース_ミニフォト,
  瞬きさえ忘れる_ミニフォト,
  ライブ女子_ミニフォト,
  ハロウィン2024_ミニフォト,
  高嶺のなでしこ2024衣装_ミニフォト,
];

export const OTHER_PHOTOS: RandomGoods[] = [ハニフェス_生写真];
