import { アンチファン衣装_生写真 } from "./2022/2022-08-08_生写真「アンチファン衣装」";
import { うぶごえ_生写真 } from "./2022/2022-08-29_生写真「うぶごえ限定」";
import { _2022秋服_生写真 } from "./2022/2022-10-01_生写真「2022秋服」";
import { ハロウィン_生写真 } from "./2022/2022-10-31_生写真「ハロウィン」";
import { 昭和レトロ_生写真 } from "./2022/2022-11-22_生写真「昭和レトロ」";
import { _2022サンタ_生写真 } from "./2022/2022-12-25_生写真「2022サンタ」";
import { _2023年振袖_生写真 } from "./2023/2023-01-01_生写真「2023年振袖」";
import { バレンタイン_生写真 } from "./2023/2023-02-14_生写真「バレンタイン」";
import { _2023年制服卒業シーズン_生写真 } from "./2023/2023-03-23_生写真「2023年制服卒業シーズン」";
import { たかねこ全国お招きツアー2023衣装_ミニフォト } from "./2023/2023-04-23_ミニフォトカード「たかねこ全国お招きツアー 2023」";
import { たかねこ全国お招きツアー2023衣装_生写真 } from "./2023/2023-04-23_生写真「たかねこ全国お招きツアー 2023」";
import { イースター_生写真 } from "./2023/2023-05-01_生写真「イースター」";
import { スーツ_生写真 } from "./2023/2023-06-11_生写真「スーツ」";
import { スーツメガネ_生写真 } from "./2023/2023-06-11_生写真「スーツメガネ」";
import { 梅雨_生写真 } from "./2023/2023-06-29_生写真「梅雨」";
import { マリン_生写真 } from "./2023/2023-07-11_生写真「マリン」";
import { 浴衣_生写真 } from "./2023/2023-08-09_生写真「浴衣」";
import { 浴衣_ミニフォト } from "./2023/2023-08-14_ミニフォトカード「浴衣」";
import { 僕は君になれない衣装_ミニフォト } from "./2023/2023-09-03_ミニフォトカード「僕は君になれない衣装」";
import { 僕は君になれない衣装_生写真 } from "./2023/2023-09-03_生写真「僕は君になれない衣装」";
import { 初恋のひと_生写真 } from "./2023/2023-09-12_生写真「初恋のひと。」";
import { povo20_生写真 } from "./2023/2023-10-02_生写真「povo」";
import { _2023ハロウィン_ミニフォト } from "./2023/2023-10-09_ミニフォトカード「2023ハロウィン」";
import { _2023ハロウィン_生写真 } from "./2023/2023-10-25_生写真「2023ハロウィン」";
import { 海の妖精_ミニフォト } from "./2023/2023-11-29_ミニフォトカード「海の妖精」";
import { 海の妖精_生写真 } from "./2023/2023-11-29_生写真「海の妖精」";
import { ウインター_生写真 } from "./2023/2023-12-08_生写真「ウインター」";
import { ホワイトサンタ2023_ミニフォト } from "./2023/2023-12-24_ミニフォトカード「ホワイトサンタ2023」";
import { ホワイトサンタ2023_生写真 } from "./2023/2023-12-24_生写真「ホワイトサンタ2023」";
import { _2024年振袖_生写真 } from "./2024/2024-01-03_生写真「2024年振袖」";
import { _2024年振袖_ミニフォト } from "./2024/2024-01-06_ミニフォトカード「2024年振袖」";
import { _2024年バレンタイン_ミニフォト } from "./2024/2024-02-14_ミニフォトカード「2024年バレンタイン」";
import { _2024年バレンタイン_生写真 } from "./2024/2024-02-14_生写真「2024年バレンタイン」";
import { 恋を知った世界_ミニフォト } from "./2024/2024-03-03_ミニフォトカード「恋を知った世界」";
import { 恋を知った世界_生写真 } from "./2024/2024-03-27_生写真「恋を知った世界」";
import { Beginning_ミニフォト } from "./2024/2024-04-08_ミニフォトカード「Beginning」";
import { Beginning_生写真 } from "./2024/2024-04-08_生写真「Beginning」";
import { ハニフェス_生写真 } from "./2024/2024-04-29_生写真「ハニフェス」";
import { わたし色に染まれ_ミニフォト } from "./2024/2024-05-12_ミニフォトカード「わたし色に染まれ」";
import { わたし色に染まれ_生写真 } from "./2024/2024-05-12_生写真「わたし色に染まれ」";
import { ワンピース_ミニフォト } from "./2024/2024-05-27_ミニフォトカード「ワンピース」";
import { ワンピース_生写真 } from "./2024/2024-05-27_生写真「ワンピース」";
import { メイド至上主義_ミニフォト } from "./2024/2024-06-21_ミニフォトカード「メイド☆至上主義」";
import { メイド至上主義_生写真 } from "./2024/2024-06-21_生写真「メイド☆至上主義」";
import { 浴衣2024_生写真 } from "./2024/2024-07-12_生写真「浴衣2024」";
import { 浴衣2024_ミニフォト } from "./2024/2024-07-21_ミニフォトカード「浴衣2024」";
import { 成長発表会_FC抽選会_メンバー個別デザインステッカー } from "./2024/2024-08-07_ステッカー「2nd ファンミーティング〜成長発表会〜 FC抽選会」";
import { 白ワンピース_生写真 } from "./2024/2024-08-07_生写真「白ワンピース」";
import { 白ワンピース_ミニフォト } from "./2024/2024-08-12_ミニフォトカード「白ワンピース」";
import { 瞬きさえ忘れる_アクリルブロック } from "./2024/2024-09-15_アクリルブロック「瞬きさえ忘れる。」";
import { 瞬きさえ忘れる_にゃでしこステッカー } from "./2024/2024-09-15_ステッカー「瞬きさえ忘れる。」";
import { 瞬きさえ忘れる_ミニフォト } from "./2024/2024-09-15_ミニフォトカード「瞬きさえ忘れる。」";
import { 瞬きさえ忘れる_生写真 } from "./2024/2024-09-15_生写真「瞬きさえ忘れる。」";
import { ライブ女子_ミニフォト } from "./2024/2024-10-25_ミニフォトカード「ライブ女子」";
import { ライブ女子_生写真 } from "./2024/2024-10-30_生写真「ライブ女子」";
import { ハロウィン2024_ステッカー } from "./2024/2024-10-31_ステッカー「ハロウィン2024」";
import { ハロウィン2024_ミニフォト } from "./2024/2024-10-31_ミニフォトカード「ハロウィン2024」";
import { ハロウィン2024_生写真 } from "./2024/2024-10-31_生写真「ハロウィン2024」";
import { 高嶺のなでしこ2024衣装_ミニフォト } from "./2024/2024-11-08_ミニフォトカード「高嶺のなでしこ2024衣装」";
import { 高嶺のなでしこ2024衣装_生写真 } from "./2024/2024-11-08_生写真「高嶺のなでしこ2024衣装」";
import { クリスマス2024_ミニフォト } from "./2024/2024-12-25_ミニフォトカード「クリスマス2024」";
import { クリスマス2024_生写真 } from "./2024/2024-12-25_生写真「クリスマス2024」";
import { クリスマス2024_目印チャーム } from "./2024/2024-12-25_目印チャーム「クリスマス2024」";
import { クリスマス2024_缶バッジ } from "./2024/2024-12-25_缶バッジ「クリスマス2024」";
import { 晴れ着2025_ミニフォト } from "./2025/2025-01-02_ミニフォトカード「晴れ着2025」";
import { 晴れ着2025_生写真 } from "./2025/2025-01-02_生写真「晴れ着2025」";
import { バレンタイン2025_ミニフォト } from "./2025/2025-02-14_ミニフォトカード「バレンタイン2025」";
import { バレンタイン2025_生写真 } from "./2025/2025-02-14_生写真「バレンタイン2025」";
import { ピンク衣装_ミニフォト } from "./2025/2025-03-05_ミニフォトカード「ピンク衣装」";
import { ピンク衣装_生写真 } from "./2025/2025-03-26_生写真「ピンク衣装」";
import { 韓国風制服_ミニフォト } from "./2025/2025-04-06_ミニフォトカード「韓国風制服」";
import { 韓国風制服_生写真 } from "./2025/2025-04-06_生写真「韓国風制服」";
import { _2025春衣装_ミニフォト } from "./2025/2025-05-06_ミニフォトカード「2025 春衣装」";
import { _2025春衣装_生写真 } from "./2025/2025-05-06_生写真「2025 春衣装」";
import { アイドル衣装_ミニフォト } from "./2025/2025-06-01_ミニフォトカード「アイドル衣装」";
import { アイドル衣装_生写真 } from "./2025/2025-06-17_生写真「アイドル衣装」";
import { RandomGoods } from "./product";

export const PHOTOS: RandomGoods[] = [
  アイドル衣装_生写真,
  _2025春衣装_生写真,
  韓国風制服_生写真,
  ピンク衣装_生写真,
  バレンタイン2025_生写真,
  晴れ着2025_生写真,
  クリスマス2024_生写真,
  高嶺のなでしこ2024衣装_生写真,
  ハロウィン2024_生写真,
  ライブ女子_生写真,
  瞬きさえ忘れる_生写真,
  白ワンピース_生写真,
  浴衣2024_生写真,
  メイド至上主義_生写真,
  ワンピース_生写真,
  わたし色に染まれ_生写真,
  Beginning_生写真,
  恋を知った世界_生写真,
  _2024年バレンタイン_生写真,
  _2024年振袖_生写真,
  ホワイトサンタ2023_生写真,
  ウインター_生写真,
  海の妖精_生写真,
  _2023ハロウィン_生写真,
  povo20_生写真,
  僕は君になれない衣装_生写真,
  初恋のひと_生写真,
  浴衣_生写真,
  マリン_生写真,
  梅雨_生写真,
  スーツメガネ_生写真,
  スーツ_生写真,
  イースター_生写真,
  たかねこ全国お招きツアー2023衣装_生写真,
  _2023年制服卒業シーズン_生写真,
  バレンタイン_生写真,
  _2023年振袖_生写真,
  _2022サンタ_生写真,
  昭和レトロ_生写真,
  ハロウィン_生写真,
  _2022秋服_生写真,
  うぶごえ_生写真,
  アンチファン衣装_生写真,
];

export const MINI_PHOTO_CARDS: RandomGoods[] = [
  アイドル衣装_ミニフォト,
  _2025春衣装_ミニフォト,
  韓国風制服_ミニフォト,
  ピンク衣装_ミニフォト,
  バレンタイン2025_ミニフォト,
  晴れ着2025_ミニフォト,
  クリスマス2024_ミニフォト,
  高嶺のなでしこ2024衣装_ミニフォト,
  ハロウィン2024_ミニフォト,
  ライブ女子_ミニフォト,
  瞬きさえ忘れる_ミニフォト,
  白ワンピース_ミニフォト,
  浴衣2024_ミニフォト,
  メイド至上主義_ミニフォト,
  ワンピース_ミニフォト,
  わたし色に染まれ_ミニフォト,
  Beginning_ミニフォト,
  恋を知った世界_ミニフォト,
  _2024年バレンタイン_ミニフォト,
  _2024年振袖_ミニフォト,
  ホワイトサンタ2023_ミニフォト,
  海の妖精_ミニフォト,
  _2023ハロウィン_ミニフォト,
  僕は君になれない衣装_ミニフォト,
  浴衣_ミニフォト,
  たかねこ全国お招きツアー2023衣装_ミニフォト,
];

export const OTHER_PHOTOS: RandomGoods[] = [
  クリスマス2024_缶バッジ,
  クリスマス2024_目印チャーム,
  ハロウィン2024_ステッカー,
  瞬きさえ忘れる_アクリルブロック,
  瞬きさえ忘れる_にゃでしこステッカー,
  成長発表会_FC抽選会_メンバー個別デザインステッカー,
  ハニフェス_生写真,
];
