import { アンチファン衣装_生写真 } from "./2022/2022-08-08_生写真「アンチファン衣装」";
import { うぶごえ_生写真 } from "./2022/2022-08-29_生写真「うぶごえ限定」";
import { _2022秋服_生写真 } from "./2022/2022-10-01_生写真「2022秋服」";
import { ハロウィン_生写真 } from "./2022/2022-10-31_生写真「ハロウィン」";
import { 昭和レトロ_生写真 } from "./2022/2022-11-22_生写真「昭和レトロ」";
import { _2022サンタ_生写真 } from "./2022/2022-12-25_生写真「2022サンタ」";
import { クリスマス2022_缶バッジ } from "./2022/2022-12-25_缶バッジ「たかねこクリスマスパーティー2022」";
import { _2023年振袖_生写真 } from "./2023/2023-01-01_生写真「2023年振袖」";
import { バレンタイン_生写真 } from "./2023/2023-02-14_生写真「バレンタイン」";
import { _2023年制服卒業シーズン_生写真 } from "./2023/2023-03-23_生写真「2023年制服卒業シーズン」";
import { たかねこ全国お招きツアー2023衣装_ミニフォト } from "./2023/2023-04-23_ミニフォトカード「たかねこ全国お招きツアー 2023」";
import { たかねこ全国お招きツアー2023衣装_生写真 } from "./2023/2023-04-23_生写真「たかねこ全国お招きツアー 2023」";
import { イースター_生写真 } from "./2023/2023-05-01_生写真「イースター」";
import { スーツ_生写真 } from "./2023/2023-06-11_生写真「スーツ」";
import { スーツメガネ_生写真 } from "./2023/2023-06-11_生写真「スーツメガネ」";
import { 梅雨_生写真 } from "./2023/2023-06-29_生写真「梅雨」";
import { マリン_生写真 } from "./2023/2023-07-11_生写真「マリン」";
import { 浴衣_生写真 } from "./2023/2023-08-09_生写真「浴衣」";
import { 浴衣_ミニフォト } from "./2023/2023-08-14_ミニフォトカード「浴衣」";
import { 僕は君になれない衣装_ミニフォト } from "./2023/2023-09-03_ミニフォトカード「僕は君になれない衣装」";
import { 僕は君になれない衣装_生写真 } from "./2023/2023-09-03_生写真「僕は君になれない衣装」";
import { 初恋のひと_生写真 } from "./2023/2023-09-12_生写真「初恋のひと。」";
import { povo20_生写真 } from "./2023/2023-10-02_生写真「povo」";
import { _2023ハロウィン_ミニフォト } from "./2023/2023-10-09_ミニフォトカード「2023ハロウィン」";
import { _2023ハロウィン_生写真 } from "./2023/2023-10-25_生写真「2023ハロウィン」";
import { 海の妖精_ミニフォト } from "./2023/2023-11-29_ミニフォトカード「海の妖精」";
import { 海の妖精_生写真 } from "./2023/2023-11-29_生写真「海の妖精」";
import { ウインター_生写真 } from "./2023/2023-12-08_生写真「ウインター」";
import { ホワイトサンタ2023_ミニフォト } from "./2023/2023-12-24_ミニフォトカード「ホワイトサンタ2023」";
import { ホワイトサンタ2023_生写真 } from "./2023/2023-12-24_生写真「ホワイトサンタ2023」";
import { クリスマス2023_缶バッジ } from "./2023/2023-12-24_缶バッジ「2023年クリスマス」";
import { _2024年振袖_生写真 } from "./2024/2024-01-03_生写真「2024年振袖」";
import { _2024年振袖_ミニフォト } from "./2024/2024-01-06_ミニフォトカード「2024年振袖」";
import { _2024年バレンタイン_ミニフォト } from "./2024/2024-02-14_ミニフォトカード「2024年バレンタイン」";
import { _2024年バレンタイン_生写真 } from "./2024/2024-02-14_生写真「2024年バレンタイン」";
import { 恋を知った世界_ミニフォト } from "./2024/2024-03-03_ミニフォトカード「恋を知った世界」";
import { 恋を知った世界_生写真 } from "./2024/2024-03-27_生写真「恋を知った世界」";
import { 学生証風_ステッカー } from "./2024/2024-04-08_ステッカー「学生証風」";
import { Beginning_ミニフォト } from "./2024/2024-04-08_ミニフォトカード「Beginning」";
import { Beginning_生写真 } from "./2024/2024-04-08_生写真「Beginning」";
import { ハニフェス_生写真 } from "./2024/2024-04-29_生写真「ハニフェス」";
import { ハニフェス_缶バッジ } from "./2024/2024-04-29_缶バッジ「ハニフェス」";
import { にゃでしこ_アクリルキーホルダー } from "./2024/2024-05-12_アクリルキーホルダー「にゃでしこ」";
import { わたし色に染まれ_ミニフォト } from "./2024/2024-05-12_ミニフォトカード「わたし色に染まれ」";
import { にゃでしこ_前髪クリップ } from "./2024/2024-05-12_前髪クリップ「にゃでしこ」";
import { わたし色に染まれ_生写真 } from "./2024/2024-05-12_生写真「わたし色に染まれ」";
import { ワンピース_ミニフォト } from "./2024/2024-05-27_ミニフォトカード「ワンピース」";
import { ワンピース_生写真 } from "./2024/2024-05-27_生写真「ワンピース」";
import { メイド至上主義_ミニフォト } from "./2024/2024-06-21_ミニフォトカード「メイド☆至上主義」";
import { メイド至上主義_生写真 } from "./2024/2024-06-21_生写真「メイド☆至上主義」";
import { 浴衣2024_生写真 } from "./2024/2024-07-12_生写真「浴衣2024」";
import { アイトーク_フォトカード } from "./2024/2024-07-15_フォトカード「アイトーク」";
import { 浴衣2024_ミニフォト } from "./2024/2024-07-21_ミニフォトカード「浴衣2024」";
import { 成長発表会_FC抽選会_メンバー個別デザインステッカー } from "./2024/2024-08-07_ステッカー「2nd ファンミーティング〜成長発表会〜 FC抽選会」";
import { _2ndファンミ_にゃでしこステッカー } from "./2024/2024-08-07_ステッカー「2ndファンミ」";
import { 白ワンピース_生写真 } from "./2024/2024-08-07_生写真「白ワンピース」";
import { _2ndファンミ_缶バッジ } from "./2024/2024-08-07_缶バッジ「2ndファンミ」";
import { 白ワンピース_ミニフォト } from "./2024/2024-08-12_ミニフォトカード「白ワンピース」";
import { 瞬きさえ忘れる_アクリルブロック } from "./2024/2024-09-15_アクリルブロック「瞬きさえ忘れる。」";
import { 瞬きさえ忘れる_にゃでしこステッカー } from "./2024/2024-09-15_ステッカー「瞬きさえ忘れる。」";
import { 瞬きさえ忘れる_ミニフォト } from "./2024/2024-09-15_ミニフォトカード「瞬きさえ忘れる。」";
import { 瞬きさえ忘れる_生写真 } from "./2024/2024-09-15_生写真「瞬きさえ忘れる。」";
import { 瞬きさえ忘れる_缶バッジ } from "./2024/2024-09-15_缶バッジ「瞬きさえ忘れる。」";
import { 大青春祭2024_メッセージカード } from "./2024/2024-10-02_メッセージカード「大青春祭 2024 限定販売」";
import { 瞬きさえ忘れる_FC抽選会_メンバー個別デザインステッカー } from "./2024/2024-10-06_ステッカー「瞬きさえ忘れる。FC抽選会」";
import { ライブ女子_ミニフォト } from "./2024/2024-10-25_ミニフォトカード「ライブ女子」";
import { ライブ女子_生写真 } from "./2024/2024-10-30_生写真「ライブ女子」";
import { ハロウィン2024_ステッカー } from "./2024/2024-10-31_ステッカー「ハロウィン2024」";
import { ハロウィン2024_ミニフォト } from "./2024/2024-10-31_ミニフォトカード「ハロウィン2024」";
import { ハロウィン2024_生写真 } from "./2024/2024-10-31_生写真「ハロウィン2024」";
import { 生明祭限定_参加証明書カード } from "./2024/2024-11-03_カード「生明祭限定 参加証明書カード」";
import { 高嶺のなでしこ2024衣装_ミニフォト } from "./2024/2024-11-08_ミニフォトカード「高嶺のなでしこ2024衣装」";
import { 高嶺のなでしこ2024衣装_生写真 } from "./2024/2024-11-08_生写真「高嶺のなでしこ2024衣装」";
import { ミニアクリルスタンドキーホルダーメンバーソロ写真 } from "./2024/2024-12-11_セブンネット限定特典「2nd シングル  I’M YOUR IDOL／アドレナリンゲーム」";
import { セカンドシングル_ソロ盤 } from "./2024/2024-12-11_ソロ盤「2nd シングル I’M YOUR IDOL／アドレナリンゲーム」";
import { クリスマス2024_ミニフォト } from "./2024/2024-12-25_ミニフォトカード「クリスマス2024」";
import { クリスマス2024_生写真 } from "./2024/2024-12-25_生写真「クリスマス2024」";
import { クリスマス2024_目印チャーム } from "./2024/2024-12-25_目印チャーム「クリスマス2024」";
import { クリスマス2024_缶バッジ } from "./2024/2024-12-25_缶バッジ「クリスマス2024」";
import { 晴れ着2025_ミニフォト } from "./2025/2025-01-02_ミニフォトカード「晴れ着2025」";
import { 晴れ着2025_生写真 } from "./2025/2025-01-02_生写真「晴れ着2025」";
import { 春野莉々誕生日記念グッズ_生写真 } from "./2025/2025-01-16_春野莉々誕生日記念グッズ生写真";
import { コージー本舗第2弾アイトーク_フォトカード } from "./2025/2025-02-07_フォトカード「コージー本舗コラボレーション第2弾アイトーク」";
import { コージー本舗第2弾アイラッシュカーラー_フォトカード } from "./2025/2025-02-07_フォトカード「コージー本舗コラボレーション第2弾アイラッシュカーラー」";
import { CuteForLife_アクリルキーホルダー } from "./2025/2025-02-14_アクリルキーホルダー「Cute for life FC抽選会」";
import { CuteForLife_ステッカー } from "./2025/2025-02-14_ステッカー「Cute for life FC抽選会」";
import { バレンタイン2025_ミニフォト } from "./2025/2025-02-14_ミニフォトカード「バレンタイン2025」";
import { メンバー個別メッセージ継続特典バレンタインデザイン_ミニフォト } from "./2025/2025-02-14_ミニフォトカード「メンバー個別メッセージ継続特典バレンタインデザイン」";
import { ラブレターカード } from "./2025/2025-02-14_ラブレターカード";
import { バレンタイン2025_生写真 } from "./2025/2025-02-14_生写真「バレンタイン2025」";
import { たかねこフェスvol4_目印チャーム } from "./2025/2025-02-14_目印チャーム「たかねこフェス vol.4」";
import { ピンク衣装_ミニフォト } from "./2025/2025-03-05_ミニフォトカード「ピンク衣装」";
import { ピンク衣装_生写真 } from "./2025/2025-03-26_生写真「ピンク衣装」";
import { 韓国風制服_ミニフォト } from "./2025/2025-04-06_ミニフォトカード「韓国風制服」";
import { 韓国風制服_生写真 } from "./2025/2025-04-06_生写真「韓国風制服」";
import { FAVE_IDOLS_オンラインくじ } from "./2025/2025-04-22_『FAVE IDOLS〜今推したい最強アイドル〜』× 『高嶺のなでしこ』番組コラボ オンラインくじ";
import { FAVE_IDOLS_オンラインくじ10連特典 } from "./2025/2025-04-22_『FAVE IDOLS〜今推したい最強アイドル〜』× 『高嶺のなでしこ』番組コラボ オンラインくじ 10連特典";
import { FAVE_IDOLS_オンラインくじA賞 } from "./2025/2025-04-22_『FAVE IDOLS〜今推したい最強アイドル〜』× 『高嶺のなでしこ』番組コラボ オンラインくじ A賞";
import { FAVE_IDOLS_オンラインくじB賞 } from "./2025/2025-04-22_『FAVE IDOLS〜今推したい最強アイドル〜』× 『高嶺のなでしこ』番組コラボ オンラインくじ B賞";
import { FAVE_IDOLS_オンラインくじC賞 } from "./2025/2025-04-22_『FAVE IDOLS〜今推したい最強アイドル〜』× 『高嶺のなでしこ』番組コラボ オンラインくじ C賞";
import { FAVE_IDOLS_オンラインくじD賞 } from "./2025/2025-04-22_『FAVE IDOLS〜今推したい最強アイドル〜』× 『高嶺のなでしこ』番組コラボ オンラインくじ D賞";
import { FAVE_IDOLS_オンラインくじE賞 } from "./2025/2025-04-22_『FAVE IDOLS〜今推したい最強アイドル〜』× 『高嶺のなでしこ』番組コラボ オンラインくじ E賞";
import { FAVE_IDOLS_オンラインくじF賞 } from "./2025/2025-04-22_『FAVE IDOLS〜今推したい最強アイドル〜』× 『高嶺のなでしこ』番組コラボ オンラインくじ F賞";
import { 歌舞伎町UP_GATE限定カード } from "./2025/2025-05-04_歌舞伎町UP GATE↑↑ 限定カード";
import { _2025春衣装_ミニフォト } from "./2025/2025-05-06_ミニフォトカード「2025 春衣装」";
import { 前髪クリップ } from "./2025/2025-05-06_前髪クリップ";
import { _2025春衣装_生写真 } from "./2025/2025-05-06_生写真「2025 春衣装」";
import { SpringRide_缶バッジ } from "./2025/2025-05-06_缶バッジ「Spring Ride」";
import { ROUND1_コラボキャンペーン_オリジナルしおり } from "./2025/2025-05-30_ROUND1 コラボキャンペーン オリジナルしおり";
import { ROUND1_コラボキャンペーン_オリジナルコースター } from "./2025/2025-05-30_ROUND1 コラボキャンペーン オリジナルコースター";
import { ROUND1_コラボキャンペーン_オリジナルステッカー } from "./2025/2025-05-30_ROUND1 コラボキャンペーン オリジナルステッカー";
import { ベトナムフェスティバル2025限定カード } from "./2025/2025-05-31_ベトナムフェスティバル2025限定カード";
import { アイドル衣装_ミニフォト } from "./2025/2025-06-01_ミニフォトカード「アイドル衣装」";
import { アイドル衣装_生写真 } from "./2025/2025-06-17_生写真「アイドル衣装」";
import { SpringRide広州上海_生写真 } from "./2025/2025-06-20_生写真「Spring Ride 広州&上海」";
import { LARME高嶺のなでしこ_ステッカー } from "./2025/2025-06-25_ステッカー「LARME×高嶺のなでしこ」";
import { LARME高嶺のなでしこ_ミニフォト } from "./2025/2025-06-25_ミニフォトカード「LARME×高嶺のなでしこ」";
import { 超NATSUZOME2025限定カード } from "./2025/2025-07-06_超NATSUZOME2025限定カード";
import { お守りアクキー } from "./2025/2025-08-07_お守りアクキー";
import { _2025浴衣_ミニフォト } from "./2025/2025-08-07_ミニフォトカード「2025 浴衣」";
import { _2025浴衣_生写真 } from "./2025/2025-08-07_生写真「2025 浴衣」";
import { Live2025SummerInSeoul_缶バッジ } from "./2025/2025-08-24_缶バッジ「LIVE 2025 SUMMER in SEOUL」";
import { AWonderfulEncounter_アクリルキーホルダー } from "./2025/2025-09-07_アクリルキーホルダー「A Wonderful Encounter FC抽選会」";
import { AWonderfulEncounter_ミニフォトカード } from "./2025/2025-09-07_ミニフォトカード「A Wonderful Encounter FC抽選会」";
import { RandomGoods, TradeTextType } from "./product";

export const TAKANEKO_PHOTOS_FEATURED: RandomGoods[] = [
  _2025浴衣_生写真,
  _2025浴衣_ミニフォト,
  お守りアクキー,
  ROUND1_コラボキャンペーン_オリジナルコースター,
  ROUND1_コラボキャンペーン_オリジナルステッカー,
];

export const TAKANEKO_PHOTOS: RandomGoods[] = [
  AWonderfulEncounter_アクリルキーホルダー,
  AWonderfulEncounter_ミニフォトカード,
  Live2025SummerInSeoul_缶バッジ,
  _2025浴衣_生写真,
  _2025浴衣_ミニフォト,
  お守りアクキー,
  超NATSUZOME2025限定カード,
  LARME高嶺のなでしこ_ミニフォト,
  LARME高嶺のなでしこ_ステッカー,
  SpringRide広州上海_生写真,
  アイドル衣装_生写真,
  アイドル衣装_ミニフォト,
  ベトナムフェスティバル2025限定カード,
  ROUND1_コラボキャンペーン_オリジナルコースター,
  ROUND1_コラボキャンペーン_オリジナルステッカー,
  ROUND1_コラボキャンペーン_オリジナルしおり,
  _2025春衣装_生写真,
  _2025春衣装_ミニフォト,
  SpringRide_缶バッジ,
  前髪クリップ,
  歌舞伎町UP_GATE限定カード,
  FAVE_IDOLS_オンラインくじ,
  FAVE_IDOLS_オンラインくじA賞,
  FAVE_IDOLS_オンラインくじB賞,
  FAVE_IDOLS_オンラインくじC賞,
  FAVE_IDOLS_オンラインくじD賞,
  FAVE_IDOLS_オンラインくじE賞,
  FAVE_IDOLS_オンラインくじF賞,
  FAVE_IDOLS_オンラインくじ10連特典,
  韓国風制服_生写真,
  韓国風制服_ミニフォト,
  たかねこフェスvol4_目印チャーム,
  ピンク衣装_生写真,
  ピンク衣装_ミニフォト,
  バレンタイン2025_生写真,
  バレンタイン2025_ミニフォト,
  ラブレターカード,
  CuteForLife_アクリルキーホルダー,
  CuteForLife_ステッカー,
  メンバー個別メッセージ継続特典バレンタインデザイン_ミニフォト,
  コージー本舗第2弾アイトーク_フォトカード,
  コージー本舗第2弾アイラッシュカーラー_フォトカード,
  春野莉々誕生日記念グッズ_生写真,
  晴れ着2025_生写真,
  晴れ着2025_ミニフォト,
  クリスマス2024_生写真,
  クリスマス2024_ミニフォト,
  クリスマス2024_缶バッジ,
  クリスマス2024_目印チャーム,
  ミニアクリルスタンドキーホルダーメンバーソロ写真,
  セカンドシングル_ソロ盤,
  高嶺のなでしこ2024衣装_生写真,
  高嶺のなでしこ2024衣装_ミニフォト,
  生明祭限定_参加証明書カード,
  ハロウィン2024_生写真,
  ハロウィン2024_ミニフォト,
  ハロウィン2024_ステッカー,
  ライブ女子_生写真,
  ライブ女子_ミニフォト,
  瞬きさえ忘れる_FC抽選会_メンバー個別デザインステッカー,
  大青春祭2024_メッセージカード,
  瞬きさえ忘れる_生写真,
  瞬きさえ忘れる_ミニフォト,
  瞬きさえ忘れる_缶バッジ,
  瞬きさえ忘れる_にゃでしこステッカー,
  瞬きさえ忘れる_アクリルブロック,
  成長発表会_FC抽選会_メンバー個別デザインステッカー,
  白ワンピース_生写真,
  白ワンピース_ミニフォト,
  _2ndファンミ_缶バッジ,
  _2ndファンミ_にゃでしこステッカー,
  浴衣2024_生写真,
  浴衣2024_ミニフォト,
  アイトーク_フォトカード,
  メイド至上主義_生写真,
  メイド至上主義_ミニフォト,
  ワンピース_生写真,
  ワンピース_ミニフォト,
  わたし色に染まれ_生写真,
  わたし色に染まれ_ミニフォト,
  にゃでしこ_アクリルキーホルダー,
  にゃでしこ_前髪クリップ,
  Beginning_生写真,
  Beginning_ミニフォト,
  学生証風_ステッカー,
  恋を知った世界_生写真,
  恋を知った世界_ミニフォト,
  ハニフェス_生写真,
  ハニフェス_缶バッジ,
  _2024年バレンタイン_生写真,
  _2024年バレンタイン_ミニフォト,
  _2024年振袖_生写真,
  _2024年振袖_ミニフォト,
  ホワイトサンタ2023_生写真,
  ホワイトサンタ2023_ミニフォト,
  クリスマス2023_缶バッジ,
  ウインター_生写真,
  海の妖精_生写真,
  海の妖精_ミニフォト,
  _2023ハロウィン_生写真,
  _2023ハロウィン_ミニフォト,
  povo20_生写真,
  僕は君になれない衣装_生写真,
  僕は君になれない衣装_ミニフォト,
  初恋のひと_生写真,
  浴衣_生写真,
  浴衣_ミニフォト,
  マリン_生写真,
  梅雨_生写真,
  スーツ_生写真,
  スーツメガネ_生写真,
  イースター_生写真,
  たかねこ全国お招きツアー2023衣装_生写真,
  たかねこ全国お招きツアー2023衣装_ミニフォト,
  _2023年制服卒業シーズン_生写真,
  バレンタイン_生写真,
  _2023年振袖_生写真,
  _2022サンタ_生写真,
  クリスマス2022_缶バッジ,
  昭和レトロ_生写真,
  ハロウィン_生写真,
  _2022秋服_生写真,
  うぶごえ_生写真,
  アンチファン衣装_生写真,
];

export const regularTakanekoPhotos = () => TAKANEKO_PHOTOS.filter(isRegularTakanekoPhoto);

export const isRegularTakanekoPhoto = (photo: RandomGoods) =>
  photo.category == "生写真" && photo.tradeText == TradeTextType.Numbering;

export const regularTakanekoMiniPhotoCards = () =>
  TAKANEKO_PHOTOS.filter(isRegularTakanekoMiniPhotoCard);

export const isRegularTakanekoMiniPhotoCard = (photo: RandomGoods) =>
  photo.category == "ミニフォト" && photo.tradeText == TradeTextType.Numbering;

export const otherTakanekoRandomGoods = () => TAKANEKO_PHOTOS.filter(isOtherTakanekoRandomGoods);

export const isOtherTakanekoRandomGoods = (photo: RandomGoods) =>
  (photo.category == "生写真" && photo.tradeText != TradeTextType.Numbering) ||
  (photo.category == "ミニフォト" && photo.tradeText != TradeTextType.Numbering) ||
  (photo.category != "生写真" && photo.category != "ミニフォト");
