import { アンチファン衣装_生写真 } from "./2022/2022-08_アンチファン衣装_生写真";
import { うぶごえ_生写真 } from "./2022/2022-09_うぶごえ_生写真";
import { _2022秋服_生写真 } from "./2022/2022-10_2022秋服_生写真";
import { ハロウィン_生写真 } from "./2022/2022-10_ハロウィン_生写真";
import { 昭和レトロ_生写真 } from "./2022/2022-11_昭和レトロ_生写真";
import { _2022サンタ_生写真 } from "./2022/2022-12_2022サンタ_生写真";
import { _2023年振袖_生写真 } from "./2023/2023-01_2023年振袖_生写真";
import { バレンタイン_生写真 } from "./2023/2023-02_バレンタイン_生写真";
import { _2023年制服卒業シーズン_生写真 } from "./2023/2023-03_2023年制服卒業シーズン_生写真";
import { たかねこ全国お招きツアー2023衣装_ミニフォト } from "./2023/2023-04_たかねこ全国お招きツアー2023衣装_ミニフォト";
import { たかねこ全国お招きツアー2023衣装_生写真 } from "./2023/2023-04_たかねこ全国お招きツアー2023衣装_生写真";
import { イースター_生写真 } from "./2023/2023-05_イースター_生写真";
import { スーツ_生写真 } from "./2023/2023-06_スーツ_生写真";
import { スーツメガネ_生写真 } from "./2023/2023-06_スーツメガネ_生写真";
import { 梅雨_生写真 } from "./2023/2023-06_梅雨_生写真";
import { マリン_生写真 } from "./2023/2023-07_マリン_生写真";
import { 浴衣_ミニフォト } from "./2023/2023-08_浴衣_ミニフォト";
import { 浴衣_生写真 } from "./2023/2023-08_浴衣_生写真";
import { 僕は君になれない衣装_ミニフォト } from "./2023/2023-09_僕は君になれない衣装_ミニフォト";
import { 僕は君になれない衣装_生写真 } from "./2023/2023-09_僕は君になれない衣装_生写真";
import { 初恋のひと_生写真 } from "./2023/2023-09_初恋のひと_生写真";
import { _2023ハロウィン_ミニフォト } from "./2023/2023-10_2023ハロウィン_ミニフォト";
import { _2023ハロウィン_生写真 } from "./2023/2023-10_2023ハロウィン_生写真";
import { povo20_生写真 } from "./2023/2023-10_povo2.0_生写真";
import { 海の妖精_ミニフォト } from "./2023/2023-11_海の妖精_ミニフォト";
import { 海の妖精_生写真 } from "./2023/2023-11_海の妖精_生写真";
import { ウインター_生写真 } from "./2023/2023-12_ウインター_生写真";
import { ホワイトサンタ2023_ミニフォト } from "./2023/2023-12_ホワイトサンタ2023_ミニフォト";
import { ホワイトサンタ2023_生写真 } from "./2023/2023-12_ホワイトサンタ2023_生写真";
import { _2024年振袖_ミニフォト } from "./2024/2024-01_2024年振袖_ミニフォト";
import { _2024年振袖_生写真 } from "./2024/2024-01_2024年振袖_生写真";
import { _2024年バレンタイン_ミニフォト } from "./2024/2024-02_2024年バレンタイン_ミニフォト";
import { _2024年バレンタイン_生写真 } from "./2024/2024-02_2024年バレンタイン_生写真";
import { 恋を知った世界_ミニフォト } from "./2024/2024-03_恋を知った世界_ミニフォト";
import { 恋を知った世界_生写真 } from "./2024/2024-03_恋を知った世界_生写真";
import { Beginning_ミニフォト } from "./2024/2024-04_Beginning_ミニフォト";
import { Beginning_生写真 } from "./2024/2024-04_Beginning_生写真";
import { ハニフェス_生写真 } from "./2024/2024-04_ハニフェス_生写真";
import { ハニフェス_缶バッジ } from "./2024/2024-04_ハニフェス_缶バッジ";
import { にゃでしこ_アクリルキーホルダー } from "./2024/2024-05_にゃでしこ_ランダムアクリルキーホルダー";
import { にゃでしこ_前髪クリップ } from "./2024/2024-05_にゃでしこ_ランダム前髪クリップ";
import { わたし色に染まれ_ミニフォト } from "./2024/2024-05_わたし色に染まれ_ミニフォト";
import { わたし色に染まれ_生写真 } from "./2024/2024-05_わたし色に染まれ_生写真";
import { ワンピース_ミニフォト } from "./2024/2024-05_ワンピース_ミニフォト";
import { ワンピース_生写真 } from "./2024/2024-05_ワンピース_生写真";
import { メイド至上主義_ミニフォト } from "./2024/2024-06_メイド☆至上主義_ミニフォト";
import { メイド至上主義_生写真 } from "./2024/2024-06_メイド☆至上主義_生写真";
import { アイトーク_フォトカード } from "./2024/2024-07_アイトーク_フォトカード";
import { 浴衣2024_ミニフォト } from "./2024/2024-07_浴衣2024_ミニフォト";
import { 浴衣2024_生写真 } from "./2024/2024-07_浴衣2024_生写真";
import { 成長発表会_FC抽選会_メンバー個別デザインステッカー } from "./2024/2024-08-07_成長発表会_FC抽選会参加賞メンバー個別デザインステッカー";
import { _2ndファンミ_にゃでしこステッカー } from "./2024/2024-08_にゃでしこ2ndファンミ_ステッカー";
import { _2ndファンミ_缶バッジ } from "./2024/2024-08_にゃでしこ2ndファンミ_缶バッジ";
import { 白ワンピース_ミニフォト } from "./2024/2024-08_白ワンピース_ミニフォト";
import { 白ワンピース_生写真 } from "./2024/2024-08_白ワンピース_生写真";
import { 瞬きさえ忘れる_にゃでしこステッカー } from "./2024/2024-09-15_瞬きさえ忘れる_にゃでしこステッカー";
import { 瞬きさえ忘れる_ミニフォト } from "./2024/2024-09-15_瞬きさえ忘れる_ミニフォト";
import { 瞬きさえ忘れる_生写真 } from "./2024/2024-09-15_瞬きさえ忘れる_生写真";
import { 瞬きさえ忘れる_缶バッジ } from "./2024/2024-09-15_瞬きさえ忘れる_缶バッジ";
import { 瞬きさえ忘れる_アクリルブロック } from "./2024/2024-09-15_瞬きさえ忘れる_落書きアクリルブロック";
import { 高嶺のなでしこ2024衣装_ミニフォト } from "./2024/2024-09-15_高嶺のなでしこ2024衣装_ミニフォト";
import { 高嶺のなでしこ2024衣装_生写真 } from "./2024/2024-09-15_高嶺のなでしこ2024衣装_生写真";
import { 大青春祭2024_メッセージカード } from "./2024/2024-10-02_大青春祭2024_メッセージカード";
import { 瞬きさえ忘れる_FC抽選会_メンバー個別デザインステッカー } from "./2024/2024-10-02_瞬きさえ忘れる_FC抽選会参加賞メンバー個別デザインステッカー";
import { ライブ女子_ミニフォト } from "./2024/2024-10-25_ライブ女子_ミニフォト";
import { ハロウィン2024_ステッカー } from "./2024/2024-10-31_ハロウィン2024_ステッカー";
import { ハロウィン2024_ミニフォト } from "./2024/2024-10-31_ハロウィン2024_ミニフォト";
import { ハロウィン2024_生写真 } from "./2024/2024-10-31_ハロウィン2024_生写真";
import { 生明祭限定_参加証明書カード } from "./2024/2024-10-31_生明祭限定_参加証明書カード";
import { RandomGoods } from "./product";

export const TAKANEKO_PHOTOS: RandomGoods[] = [
  アンチファン衣装_生写真,
  うぶごえ_生写真,
  _2022秋服_生写真,
  ハロウィン_生写真,
  昭和レトロ_生写真,
  _2022サンタ_生写真,
  _2023年振袖_生写真,
  バレンタイン_生写真,
  _2023年制服卒業シーズン_生写真,
  たかねこ全国お招きツアー2023衣装_ミニフォト,
  たかねこ全国お招きツアー2023衣装_生写真,
  イースター_生写真,
  スーツメガネ_生写真,
  スーツ_生写真,
  梅雨_生写真,
  マリン_生写真,
  浴衣_ミニフォト,
  浴衣_生写真,
  初恋のひと_生写真,
  僕は君になれない衣装_ミニフォト,
  僕は君になれない衣装_生写真,
  povo20_生写真,
  _2023ハロウィン_ミニフォト,
  _2023ハロウィン_生写真,
  海の妖精_ミニフォト,
  海の妖精_生写真,
  ウインター_生写真,
  ホワイトサンタ2023_ミニフォト,
  ホワイトサンタ2023_生写真,
  _2024年振袖_ミニフォト,
  _2024年振袖_生写真,
  _2024年バレンタイン_ミニフォト,
  _2024年バレンタイン_生写真,
  ハニフェス_缶バッジ,
  ハニフェス_生写真,
  恋を知った世界_ミニフォト,
  恋を知った世界_生写真,
  Beginning_ミニフォト,
  Beginning_生写真,
  にゃでしこ_前髪クリップ,
  にゃでしこ_アクリルキーホルダー,
  わたし色に染まれ_ミニフォト,
  わたし色に染まれ_生写真,
  ワンピース_ミニフォト,
  ワンピース_生写真,
  メイド至上主義_ミニフォト,
  メイド至上主義_生写真,
  アイトーク_フォトカード,
  浴衣2024_ミニフォト,
  浴衣2024_生写真,
  _2ndファンミ_にゃでしこステッカー,
  _2ndファンミ_缶バッジ,
  白ワンピース_ミニフォト,
  白ワンピース_生写真,
  成長発表会_FC抽選会_メンバー個別デザインステッカー,
  瞬きさえ忘れる_アクリルブロック,
  瞬きさえ忘れる_にゃでしこステッカー,
  瞬きさえ忘れる_缶バッジ,
  瞬きさえ忘れる_ミニフォト,
  瞬きさえ忘れる_生写真,
  大青春祭2024_メッセージカード,
  瞬きさえ忘れる_FC抽選会_メンバー個別デザインステッカー,
  ライブ女子_ミニフォト,
  ハロウィン2024_ステッカー,
  ハロウィン2024_ミニフォト,
  ハロウィン2024_生写真,
  生明祭限定_参加証明書カード,
  高嶺のなでしこ2024衣装_ミニフォト,
  高嶺のなでしこ2024衣装_生写真,
];
