import { EventMetaDescriptor } from "../../eventMeta";

export const meta: EventMetaDescriptor = {
  summary: "年末大感謝祭2025",
  category: "EVENT",
  date: "2025-12-27",
  open: undefined,
  start: "11:00",
  end: undefined,
  region: "東京",
  location: "TFT ホール 1000",
  present: ["高嶺のなでしこ2"],
  absent: ["籾山ひめり"],
  images: [
    {
      path: "",
      ref: "",
    },
  ],
  link: {
    text: "イベント詳細 - 公式ニュース",
    url: "https://takanenonadeshiko.jp/?p=4789",
  },
  ticket: "https://ch.chara-ani.com/",
  streamings: undefined,
  goods: {
    time: undefined,
    lineup: undefined,
    url: undefined,
  },
  meetAndGreet: {
    sessions: [
      {
        title: "1 部 個別 2 ショット撮影会",
        start: "11:00",
        end: "11:45",
        costume: "「病名恋ワズライ」衣装",
        lanes: ["涼海すう", "葉月紗蘭", "松本ももな", "籾山ひめり"],
      },
      {
        title: "2 部 個別 2 ショット撮影会",
        start: "12:00",
        end: "12:45",
        costume: "「病名恋ワズライ」衣装",
        lanes: ["城月菜央", "橋本桃呼", "東山恵里沙", "日向端ひな", "星谷美来"],
      },
      {
        title: "3 部 個別 TikTok 撮影会",
        start: "13:00",
        end: "13:45",
        costume: "「病名恋ワズライ」衣装",
        lanes: ["涼海すう", "葉月紗蘭", "松本ももな", "籾山ひめり"],
      },
      {
        title: "4 部 個別 TikTok 撮影会",
        start: "14:00",
        end: "14:45",
        costume: "「病名恋ワズライ」衣装",
        lanes: ["城月菜央", "橋本桃呼", "東山恵里沙", "日向端ひな", "星谷美来"],
      },
      {
        title: "5 部 個別 TikTok 撮影会",
        start: "15:00",
        end: "15:45",
        costume: "高嶺のなでしこ×michellMacaron コラボアイテム",
        lanes: ["涼海すう", "葉月紗蘭", "松本ももな", "籾山ひめり"],
      },
      {
        title: "6 部 個別 TikTok 撮影会",
        start: "16:00",
        end: "16:45",
        costume: "高嶺のなでしこ×michellMacaron コラボアイテム",
        lanes: ["城月菜央", "橋本桃呼", "東山恵里沙", "日向端ひな", "星谷美来"],
      },
      {
        title: "7 部 個別 2 ショット撮影会",
        start: "17:00",
        end: "17:45",
        costume: "私服",
        lanes: ["涼海すう", "葉月紗蘭", "松本ももな", "籾山ひめり"],
      },
      {
        title: "8 部 個別 2 ショット撮影会",
        start: "18:00",
        end: "18:45",
        costume: "私服",
        lanes: ["城月菜央", "橋本桃呼", "東山恵里沙", "日向端ひな", "星谷美来"],
      },
    ],
  },
  updatedAt: "2026-04-04",
};

export const content = /* md */ `
  ## イベント概要

  個別 TikTok 撮影会 & 個別 2 ショット撮影会

  ## 事前販売

  ### 個別 TikTok 撮影会

  #### 1 回目受付

  - **受付期間:** 12月04日(木) 17:00 〜 12月05日(金) 14:00
  - **抽選結果:** 12月05日(金) 15:00 以降 メール連絡
  - **申込制限:** 5 種まで、1 種あたり 1枚まで。最大で 5 枚まで。

  #### 2 回目受付

  - **受付期間:** 12月05日(金) 17:00 〜 12月06日(土) 14:00
  - **抽選結果:** 12月06日(土) 15:00 以降 メール連絡
  - **申込制限:** 5 種まで、1 種あたり 1枚まで。最大で 5 枚まで。

  #### 3 回目受付

  - **:受付期間** 12月06日(土) 17:00 〜 12月07日(日) 14:00
  - **:抽選結果** 12月07日(日) 15:00 以降 メール連絡
  - **:申込制限** 5 種まで、1 種あたり 1枚まで。最大で 5 枚まで。

  ### 個別 2 ショット撮影会

  #### 1 回目受付

  - **受付期間:** 12月04日(木) 17:00 〜 12月05日(金) 14:00
  - **抽選結果:** 12月05日(金) 15:00 以降 メール連絡
  - **申込制限:** 5 種まで。1 種あたり 1 枚まで。最大で 5 枚まで。

  #### 2 回目受付

  - **受付期間:** 12月05日(金) 17:00 〜 12月06日(土) 14:00
  - **抽選結果:** 12月06日(土) 15:00 以降 メール連絡
  - **申込制限:** 5 種まで。1 種あたり 2 枚まで。最大で 10 枚まで。

  #### 3 回目受付

  - **受付期間:** 12月06日(土) 17:00 〜 12月07日(日) 14:00
  - **抽選結果:** 12月07日(日) 15:00 以降 メール連絡
  - **申込制限:** 5 種まで。1 種あたり 3 枚まで。最大で 15 枚まで。

  ## リンク

  - [詳細について - 公式ニュース](https://takanenonadeshiko.jp/?p=4901)
  - [当日券のお知らせ - 公式ニュース](https://takanenonadeshiko.jp/?p=4891)
  - [返金のお知らせ - 公式ニュース](https://takanenonadeshiko.jp/?p=4886)
  - [予約販売開始のお知らせ - 公式ニュース](https://takanenonadeshiko.jp/?p=4789)
  - [告知 - 公式 X](https://x.com/takanenofficial/status/1996489653185298675)
`;
