import { 僕は君になれない衣装_ミニフォト } from "../2023/2023-09-03_ミニフォトカード「僕は君になれない衣装」";
import { 僕は君になれない衣装_生写真 } from "../2023/2023-09-03_生写真「僕は君になれない衣装」";
import { 海の妖精_ミニフォト } from "../2023/2023-11-29_ミニフォトカード「海の妖精」";
import { 海の妖精_生写真 } from "../2023/2023-11-29_生写真「海の妖精」";
import { LiveGoodsCollection } from "../product";

export const _1周年記念ライブ美しく生きろ: LiveGoodsCollection = {
  slug: "1 周年記念ライブ 〜美しく生きろ〜",
  name: "1 周年記念ライブ 〜美しく生きろ〜",
  images: [
    {
      path: "/takaneko/live-goods/2023-09-03_1周年記念ライブ 〜美しく生きろ〜_グッズメニュー.jpg",
      ref: "https://x.com/takanenofficial/status/1696485470803562622",
    },
  ],
  goods: [
    {
      type: "物販",
      lineup: [
        "1周年記念ライブTシャツ (たかねこちゃん集合デザイン)",
        "1周年記念ライブTシャツ (たかねこちゃん個別デザイン)",
        "グループペンライト",
        "たかねこちゃん個別アクリルキーホルダー",
        "1周年記念ライブ個別アクリルスタンド",
        "1周年記念ライブクリアファイル (ランダム)",
        "1周年記念ライブたかねこちゃん個別タオル",
        "1周年記念ライブステッカー",
        僕は君になれない衣装_生写真,
        僕は君になれない衣装_ミニフォト,
      ],
    },
  ],
};

export const _1周年記念ライブ美しく生きろ大阪公演: LiveGoodsCollection = {
  slug: "1 周年記念ライブ 〜美しく生きろ〜 大阪公演",
  name: "1 周年記念ライブ 〜美しく生きろ〜 大阪公演",
  images: [
    {
      path: "/takaneko/live-goods/2023-11-19_1周年記念ライブ 〜美しく生きろ〜大阪公演_グッズメニュー.jpg",
      ref: "https://x.com/takanenofficial/status/1696485470803562622",
    },
  ],
  goods: [
    {
      type: "物販",
      lineup: [
        "1周年記念ライブTシャツ (たかねこちゃん集合デザイン)",
        "1周年記念ライブTシャツ (たかねこちゃん個別デザイン)",
        "グループペンライト",
        "たかねこちゃん個別アクリルキーホルダー",
        "1周年記念ライブ個別アクリルスタンド",
        "1周年記念ライブクリアファイル (ランダム)",
        "1周年記念ライブたかねこちゃん個別タオル",
        "1周年記念ライブステッカー",
        僕は君になれない衣装_生写真,
        僕は君になれない衣装_ミニフォト,
        海の妖精_生写真,
        海の妖精_ミニフォト,
      ],
    },
  ],
};
