import { 成長発表会_FC抽選会_メンバー個別デザインステッカー } from "../2024/2024-08-07_ステッカー「2nd ファンミーティング〜成長発表会〜 FC抽選会」";
import { 白ワンピース_生写真 } from "../2024/2024-08-07_生写真「白ワンピース」";
import { LiveGoodsCollection } from "../product";

export const _2ndファンミーティング成長発表会: LiveGoodsCollection = {
  slug: "2nd ファンミーティング〜成長発表会〜",
  name: "2nd ファンミーティング〜成長発表会〜",
  images: [
    {
      path: "/takaneko/live-goods/2024-08-07_2nd ファンミーティング〜成長発表会〜_グッズメニュー.jpg",
      ref: "https://x.com/takanenofficial/status/1820437183922327624",
    },
  ],
  goods: [
    {
      type: "物販",
      lineup: [
        "Tシャツ「2ndファンミver.」",
        "にゃでしこ個別マスコットキーホルダー",
        "個別マフラータオル「2ndファンミver.」",
        "ランダムにゃでしこステッカー「2ndファンミver.」",
        "個別タペストリー「2ndファンミver.」",
        "ランダム缶バッジ「2ndファンミver.」",
        "個別アクリルキーホルダー「2ndファンミver.」",
        "個別アクリルスタンド「2ndファンミver.」",
        白ワンピース_生写真,
      ],
    },
    {
      type: "ファンクラブ抽選会",
      lineup: ["直筆サイン入り T シャツ", 成長発表会_FC抽選会_メンバー個別デザインステッカー],
    },
    {
      type: "サイン入りグッズ抽選会 1 部",
      lineup: [
        "葉月紗蘭 個別アクリルスタンド「2ndファンミver.」",
        "城月菜央 個別アクリルキーホルダー「2ndファンミver.」",
        "星谷美来 個別アクリルキーホルダー「2ndファンミver.」",
        "春野莉々 個別アクリルスタンド「2ndファンミver.」",
        "籾山ひめり 個別アクリルキーホルダー「2ndファンミver.」",
        "籾山ひめり 個別アクリルキーホルダー「2ndファンミver.」",
        "籾山ひめり 個別アクリルキーホルダー「2ndファンミver.」",
      ],
    },
    {
      type: "サイン入りグッズ抽選会 2 部",
      lineup: [
        "葉月紗蘭 個別アクリルキーホルダー「2ndファンミver.」",
        "涼海すう 個別アクリルスタンド「2ndファンミver.」",
        "星谷美来 個別アクリルキーホルダー「2ndファンミver.」",
        "星谷美来 個別アクリルキーホルダー「2ndファンミver.」",
        "松本ももな 個別アクリルキーホルダー「2ndファンミver.」",
        "東山恵里沙 個別アクリルスタンド「2ndファンミver.」",
        "籾山ひめり 個別アクリルキーホルダー「2ndファンミver.」",
        "日向端ひな 個別アクリルスタンド「2ndファンミver.」",
        "春野莉々 個別アクリルキーホルダー「2ndファンミver.」",
      ],
    },
    {
      type: "その他",
      lineup: ["メッセージカード", "サインボール"],
    },
  ],
};
