import { ホワイトサンタ2023_ミニフォト } from "../2023/2023-12-24_ミニフォトカード「ホワイトサンタ2023」";
import { ホワイトサンタ2023_生写真 } from "../2023/2023-12-24_生写真「ホワイトサンタ2023」";
import { LiveGoodsCollection } from "../product";

export const たかねこクリスマスパーティー2023: LiveGoodsCollection = {
  slug: "たかねこクリスマスパーティー2023",
  name: "たかねこクリスマスパーティー2023",
  images: [
    {
      path: "/takaneko/live-goods/2023-12-24_たかねこクリスマスパーティー2023_グッズメニュー.jpg",
      ref: "https://x.com/takanenofficial/status/1737810210830639176",
    },
  ],
  goods: [
    {
      type: "物販",
      lineup: [
        "グループペンライト",
        ホワイトサンタ2023_生写真,
        ホワイトサンタ2023_ミニフォト,
        "ペンライトシート (2023年クリスマス ver.)",
        "個別アクリルスタンド (2023年クリスマス ver.)",
        "SNS風アクリルキーホルダー (2023年クリスマス ver.)",
        "BIG応援うちわ (2023年クリスマス ver.)",
        "ランダム缶バッジ (2023年クリスマス ver.)",
        "高嶺のなでしこパーカー",
      ],
    },
  ],
};
