import { クリスマス2024_缶バッジ } from "../2024/2024-12-23_クリスマス2024_缶バッジ";
import { クリスマス2024_目印チャーム } from "../2024/2024-12-25_クリスマス2024_目印チャーム";
import { クリスマス2024_ミニフォト } from "../2024/2024-12-25_ミニフォトカード「クリスマス2024」";
import { クリスマス2024_生写真 } from "../2024/2024-12-25_生写真「クリスマス2024」";
import { LiveGoodsCollection } from "../product";

export const たかねこクリスマスパーティー2024: LiveGoodsCollection = {
  id: "たかねこクリスマスパーティー2024",
  name: "たかねこクリスマスパーティー2024",
  images: [
    {
      path: "/takaneko/live-goods/2024-12-25_たかねこクリスマスパーティー2024_グッズメニュー.jpg",
      ref: "https://x.com/takanenofficial/status/1871163856141066310",
    },
  ],
  goods: [
    {
      type: "物販",
      lineup: [
        "スウェット「クリスマス2024」ver.",
        "ブランケット「クリスマス2024」ver.",
        "高嶺のなでしこパーカー",
        "個別ゆらゆらアクスタ「クリスマス2024」ver.",
        "個別アクキー「クリスマス2024」ver.",
        クリスマス2024_目印チャーム,
        "個別うちわ「クリスマス2024」ver.",
        クリスマス2024_缶バッジ,
        クリスマス2024_生写真,
        クリスマス2024_ミニフォト,
        "にゃでしこ個別マスコットキーホルダー",
      ],
    },
  ],
};
