import { わたし色に染まれ_ミニフォト } from "../2024/2024-05-12_ミニフォトカード「わたし色に染まれ」";
import { わたし色に染まれ_生写真 } from "../2024/2024-05-12_生写真「わたし色に染まれ」";
import { 浴衣2024_生写真 } from "../2024/2024-07-12_生写真「浴衣2024」";
import { LiveGoodsCollection } from "../product";

export const 全国ツアー2024_わたし色に染まれ: LiveGoodsCollection = {
  id: "全国ツアー2024“わたし色に染まれ”",
  name: "全国ツアー2024“わたし色に染まれ”",
  images: [
    {
      path: "/takaneko/live-goods/2024-05-12_全国ツアー2024“わたし色に染まれ”_グッズメニュー.jpg",
      ref: "https://x.com/takanenofficial/status/1788886780433052055",
    },
  ],
  goods: [
    {
      type: "物販",
      lineup: [
        "Tシャツ (わたし色に染まれver.)",
        "ペンライト (わたし色に染まれver.)",
        "ペンライトフィルム (わたし色に染まれver.)",
        "マフラータオル (わたし色に染まれver.)",
        "BIGうちわ (わたし色に染まれver.)",
        "アクリルスタンド (わたし色に染まれver.)",
        "ペンライトストラップ (わたし色に染まれver.)",
        "ランダム前髪クリップ (にゃでしこver.)",
        "ご当地アクリフキーホルダー ずんだ (宮城)",
        "ご当地アクリフキーホルダー シャチホコ (名古屋)",
        "ご当地アクリフキーホルダー たこ焼き (大阪)",
        "ご当地アクリフキーホルダー いちご (福岡)",
        "ご当地アクリフキーホルダー もみじ饅頭 (広島)",
        "ランダムアクリフキーホルダー (にゃでしこver.)",
        "ニックネームキーホルダー",
        わたし色に染まれ_生写真,
        わたし色に染まれ_ミニフォト,
        "個別ファンネーム名札",
        "生写真アルバム (わたし色に染まれver.)",
        "ミニフォトアルバム (わたし色に染まれver.)",
      ],
    },
  ],
};

export const 全国ツアー2024_わたし色に染まれ_ファイナル東京公演: LiveGoodsCollection = {
  id: "全国ツアー2024“わたし色に染まれ”ファイナル東京公演",
  name: "全国ツアー2024“わたし色に染まれ”ファイナル東京公演",
  images: [
    {
      path: "/takaneko/live-goods/2024-07-13_全国ツアー2024“わたし色に染まれ”ファイナル東京公演_グッズメニュー1.jpg",
      ref: "https://x.com/takanenofficial/status/1811339961066729541",
    },
    {
      path: "/takaneko/live-goods/2024-07-13_全国ツアー2024“わたし色に染まれ”ファイナル東京公演_グッズメニュー2.jpg",
      ref: "https://x.com/takanenofficial/status/1811339961066729541",
    },
  ],
  goods: [
    {
      type: "物販",
      lineup: [
        "Tシャツ (わたし色に染まれver.)",
        "ペンライト (わたし色に染まれver.)",
        "ペンライトフィルム (わたし色に染まれver.)",
        "にゃでしこ個別マスコットキーホルダー",
        "ご当地アクリフキーホルダー にゃでしこ (東京)",
        "ペンライトストラップ (わたし色に染まれver.)",
        "アクリルスタンド (わたし色に染まれver.)",
        "ニックネームキーホルダー",
        "ランダム前髪クリップ (にゃでしこver.)",
        "ランダムアクリフキーホルダー (にゃでしこver.)",
        "マフラータオル (わたし色に染まれver.)",
        "BIGうちわ (わたし色に染まれver.)",
        "個別ファンネーム名札",
        "生写真アルバム (わたし色に染まれver.)",
        "ミニフォトアルバム (わたし色に染まれver.)",
        わたし色に染まれ_生写真,
        わたし色に染まれ_ミニフォト,
        浴衣2024_生写真,
      ],
    },
  ],
};
