import { たかねこ全国お招きツアー2023衣装_ミニフォト } from "../2023/2023-04-23_ミニフォトカード「たかねこ全国お招きツアー 2023」";
import { たかねこ全国お招きツアー2023衣装_生写真 } from "../2023/2023-04-23_生写真「たかねこ全国お招きツアー 2023」";
import { 梅雨_生写真 } from "../2023/2023-06-29_生写真「梅雨」";
import { LiveGoodsCollection } from "../product";

export const 全国お招きツアー2023_First_trip: LiveGoodsCollection = {
  slug: "全国お招きツアー2023 〜First trip〜",
  name: "全国お招きツアー2023 〜First trip〜",
  images: [
    {
      path: "/takaneko/live-goods/2023-04-23_高嶺のなでしこ 全国お招きツアー2023〜First trip〜_グッズメニュー.jpg",
      ref: "https://x.com/takanenofficial/status/1647883911584960513",
    },
  ],
  goods: [
    {
      type: "物販",
      lineup: [
        "たかねこ全国お招きツアー 2023 Tシャツ",
        "たかねこ全国お招きツアー 2023 ペンライト",
        "ご当地ラバーバンド",
        "ツアー衣装ステッカーシート",
        "TikTok 風個別アクリルキーホルダー",
        "たかねこ全国お招きツアー 2023 個別アクリルスタンド",
        たかねこ全国お招きツアー2023衣装_生写真,
        たかねこ全国お招きツアー2023衣装_ミニフォト,
        "ミニフォトカードアルバム たかねこ全国お招きツアー 2023",
      ],
    },
  ],
};

export const 全国お招きツアー2023_First_trip_ツアーファイナル: LiveGoodsCollection = {
  slug: "全国お招きツアー2023 〜First trip〜 ツアーファイナル",
  name: "全国お招きツアー2023 〜First trip〜 ツアーファイナル",
  images: [
    {
      path: "/takaneko/live-goods/2023-06-23_高嶺のなでしこ 全国お招きツアー2023〜First trip〜 ツアーファイナル_グッズメニュー.jpg",
      ref: "https://x.com/takanenofficial/status/1671503433030074371",
    },
  ],
  goods: [
    {
      type: "物販",
      lineup: [
        "たかねこ全国お招きツアー 2023 Tシャツ",
        "たかねこ全国お招きツアー 2023 ペンライト",
        "高嶺のなでしこパーカー",
        "高嶺のなでしこトートバッグ",
        "ご当地ラバーバンド",
        "ツアー衣装ステッカーシート",
        "グループタオル",
        "アクリルペンライト",
        "TikTok 風個別アクリルキーホルダー",
        "たかねこ全国お招きツアー 2023 個別アクリルスタンド",
        たかねこ全国お招きツアー2023衣装_生写真,
        たかねこ全国お招きツアー2023衣装_ミニフォト,
        "ミニフォトカードアルバム たかねこ全国お招きツアー 2023",
      ],
    },
    {
      type: "ツアーファイナル限定 物販",
      lineup: [
        "高嶺のなでしこパーカー",
        "高嶺のなでしこトートバッグ",
        "グループタオル",
        "アクリルペンライト",
        "ツアーファイナルタオル",
        "お招きねこアクリルキーホルダー",
        梅雨_生写真,
        "ツアーミニのぼり",
      ],
    },
  ],
};
